<a href="https://colab.research.google.com/github/AllEternal/Hamoye-Lessons-and-Quiz/blob/master/PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Convention For Impotring Pandas

In [ ]:
import pandas as pd

In [ ]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

# Creating Series With a NumPy Array

In [ ]:
import numpy as np

In [ ]:
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

# Using Strings as Index

In [ ]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'], 
                 index=['a', 'b', 'c'])

# Creating Series From a Dictionary

In [ ]:
days1 = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Tuesday'})

# Days and Days1 Print This

In [ ]:
print(days)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [ ]:
print(days1)

a     Monday
b    Tuesday
c    Tuesday
dtype: object

In [ ]:
days[0]

'Monday'

In [ ]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

In [ ]:
days['c']

'Wednesday'

In [ ]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

# Create a DataFrame From a Dictionary

In [ ]:
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60, 70, 80, 75]}

In [ ]:
  df = pd.DataFrame(df_dict, index=[2, 4, 6, 8])

In [ ]:
df_list = [['Ghana', 'Accra', 10000, 60],
           ['Kenya', 'Nairobi', 8500, 70],
           ['Nigeria', 'Abuja', 30000, 80],
           ['Togo', 'Lome', 12000, 75]]

In [ ]:
df1 = pd.DataFrame(df_list, columns=['Country', 'Capital', 'Population', 'Age'], index=[2, 4, 6, 8])

# df and df1 Prints

In [ ]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [ ]:
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       30000   80
8     Togo     Lome       12000   75

# Select The Row in The at Index 3

In [ ]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

# Slect Row With Index Label 6

In [ ]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

# Select The Capital Column

In [ ]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [ ]:
df.at[6, 'Country']

'Nigeria'

In [ ]:
df.iat[2, 0]

'Nigeria'

In [ ]:
df['Population'].sum()

65500

In [ ]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [ ]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

# Misssing Data Enigma

In [ ]:
df_dict2 = {'Name': ['James', 'Yemen', 'Caro', np.nan],
            'Profession': ['Researcher', 'Artist', 'Doctor', 'Writer'],
            'Experience': [12, np.nan, 10, 8],
            'Height': [np.nan, 175, 180, 150]}

In [ ]:
  new_df = pd.DataFrame(df_dict2)

In [ ]:
new_df

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

# Check For Cells With Missing Values as True

In [ ]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

# Remove Rows With Missing Values

In [ ]:
new_df.dropna()

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0